Revit 2027 API
CoordinationModelElementProperty.Name Property
 The name of the property.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
public:
property String^ Name {
	String^ get ();
}
member Name : string with get
Property Value
String
Remarks
 This string is taken from the source of the Coordination Model and it's not localized in Revit. For example: If the source of the Coordination Model is in Chinese, the property will always be in Chinese in Revit, regardless of the Revit language settings.
See Also
Reference
CoordinationModelElementProperty Class
Autodesk.Revit.DB.ExternalData Namespace